export interface ChunLianText {
    zhCn: string,
    zhTc: string
}

export interface ChunLianTopic {
    topic: string,
    content: Array<ChunLianText>
}

export const ChunLianSet = [
    {
        topic: '新年通用',
        content: [
            {
                zhCn: '爆竹一声除旧岁,桃符万户换新春',
                zhTc: '爆竹一聲除舊歲,桃符萬戶換新春'
            },
            {
                zhCn: '一曲笙歌春似海,千门灯火夜如年',
                zhTc: '一曲笙歌春似海,千門燈火夜如年'
            },
            {
                zhCn: '迎新春平安如意,贺佳节富贵平安',
                zhTc: '迎新春平安如意,賀佳節富貴平安'
            },
            {
                zhCn: '爆竹花开灯结彩,春红柳发岁更新',
                zhTc: '爆竹花開燈結彩,春紅柳發歲更新'
            },
            {
                zhCn: '健康幸福年年在,如意财源日日来',
                zhTc: '健康幸福年年在,如意財源日日來'
            },
            {
                zhCn: '迎新春事事如意,接鸿福步步高升',
                zhTc: '迎新春事事如意,接鴻福步步高升'
            },
            {
                zhCn: '天上朗月千里共,人间春色九州同',
                zhTc: '天上朗月千裏共,人間春色九州同'
            },
            {
                zhCn: '春丝换尽千门旧,爆竹摧开万物新',
                zhTc: '春絲换盡千門舊,爆竹摧開萬物新'
            },
            {
                zhCn: '迎新春江山锦绣,辞旧岁事泰辉煌',
                zhTc: '迎新春江山錦繡,辭舊歲事泰輝煌'
            },
            {
                zhCn: '春风送福千家暖,时雨润花万象新',
                zhTc: '春風送福千家暖,時雨潤花萬象新'
            },
            {
                zhCn: '春临大地百花艳,节至人间万象新',
                zhTc: '春臨大地百花艷,節至人間萬象新'
            },
            {
                zhCn: '平安如意福星照,富贵吉祥好运来',
                zhTc: '平安如意福星照,富貴吉祥好運來'
            }
        ]
    },
    {
        topic: '阖家欢乐',
        content: [
            {
                zhCn: '春满玉堂添富贵,花开金屋旺丁财',
                zhTc: '春滿玉堂添富貴,花開金屋旺丁財'
            },
            {
                zhCn: '一帆风顺吉星到,万事如意喜临门',
                zhTc: '一帆風順吉星到,萬事如意喜臨門'
            },
            {
                zhCn: '五福临门运气旺,吉星高照满堂春',
                zhTc: '五福臨門運氣旺,吉星高照滿堂春'
            },
            {
                zhCn: '吉祥满堂添百福,瑞气盈门纳千祥',
                zhTc: '吉祥滿堂添百福,瑞氣盈門納千祥'
            },
            {
                zhCn: '好景常临家宅旺,平安富贵福满堂',
                zhTc: '好景常临家宅旺,平安富贵福满堂'
            },
            {
                zhCn: '春到堂前花似锦,福如双至喜盈门',
                zhTc: '春到堂前花似錦,福如雙至喜盈門'
            },
            {
                zhCn: '喜居宝地千年旺,福照家门万事兴',
                zhTc: '喜居寶地千年旺,福照家門萬事興'
            },
        ]
    },
    {
        topic: '学业有成',
        content: [
            {
                zhCn: '金榜题名酬壮志,春风得意展宏图',
                zhTc: '金榜題名酬壯志,春風得意展宏圖'
            },
            {
                zhCn: '春来好景年年好,学业有成步步高',
                zhTc: '春來好景年年好,學業有成步步高'
            },
            {
                zhCn: '前途似锦千年好,春风得意万象新',
                zhTc: '前途似錦千年好,春風得意萬象新'
            },
            {
                zhCn: '迎新春前程似锦,贺佳节事泰辉煌',
                zhTc: '迎新春前程似錦,賀佳節事泰輝煌'
            },
            {
                zhCn: '春风得意年年好,前途似锦步步高',
                zhTc: '春風得意年年好,前途似錦步步高'
            },
            {
                zhCn: '名题雁塔登金榜,愉悦新禧纳千祥',
                zhTc: '名題雁塔登金榜,愉悅新喜納千祥'
            }
        ]
    },
    {
        topic: '百年好合',
        content: [
            {
                zhCn: '春风满院莺歌脆,喜气盈门鹊语甜',
                zhTc: '春風滿院莺歌脆,喜氣盈門鵲語甜'
            },
            {
                zhCn: '喜结良缘百年合,永结同心万事兴',
                zhTc: '喜結良緣百年合,永結同心萬事興'
            },
            {
                zhCn: '花好月圆迎佳偶,珠联璧合结良缘',
                zhTc: '花好月圓迎佳偶,珠聯璧合結良緣'
            },
            {
                zhCn: '正是莺歌燕舞日,恰逢花好月圆时',
                zhTc: '正是莺歌燕舞日,恰逢花好月圓時'
            },
            {
                zhCn: '紫箫吹彻蓝桥月,翠鸟翔还彩屋春',
                zhTc: '紫箫吹徹藍橋月,翠鳥翔還彩屋春'
            },
            {
                zhCn: '春临大地迎新岁,喜到人间贺佳期',
                zhTc: '春臨大地迎新歲,喜到人間賀佳期'
            },
            {
                zhCn: '花好月圆鸳鸯笑,珠联璧合鸾凤飞',
                zhTc: '花好月圓鴛鴦笑,珠聯璧合鸾鳳飛'
            }
        ]
    },
    {
        topic: '健康长寿',
        content: [
            {
                zhCn: '天增岁月人增寿,春满乾坤福满门',
                zhTc: '天增歲月人增壽,春滿乾坤福滿門'
            },
            {
                zhCn: '福禄寿三星高照,天地人四时吉祥',
                zhTc: '福禄壽三星高照,天地人四時吉祥'
            },
            {
                zhCn: '天开美景人长寿,花好月圆岁万年',
                zhTc: '天開美景人長壽,花好月圓歲萬年'
            },
            {
                zhCn: '年年如意添福寿,岁岁安康满华堂',
                zhTc: '年年如意添福壽,歲歲安康滿華堂'
            },
            {
                zhCn: '春回大地人增寿,福到人间门生辉',
                zhTc: '春回大地人增壽,福到人間門生輝'
            },
            {
                zhCn: '一帆风顺人财旺,万事如意福寿长',
                zhTc: '一帆風順人財旺,萬事如意福壽長'
            }
        ]
    },
    {
        topic: '白日做梦',
        content: [
            {
                zhCn: '天增岁月人增瘦,春满钱坤福满门',
                zhTc: '天增歲月人增瘦,春滿錢坤福滿門'
            },
            {
                zhCn: '睡觉睡到自然醒,数钱数到手抽筋',
                zhTc: '睡覺睡到自然醒,數錢數到手抽筋'
            },
            {
                zhCn: '长一岁收入翻倍,新一年更加有钱',
                zhTc: '長一歲收入翻倍,新一年更加有錢'
            },
            {
                zhCn: '新的一年腰包鼓,接着奏乐接着舞',
                zhTc: '新的一年腰包鼓,接著奏樂接著舞'
            },
            {
                zhCn: '有钱有闲福气旺,吃好喝好身体棒',
                zhTc: '有錢有閑福氣旺,吃好喝好身體棒'
            },
            {
                zhCn: '豪宅名车加钞票,成名暴富我全要',
                zhTc: '豪宅名車加鈔票,成名暴富我全要'
            }
        ]
    }
] as Array<ChunLianTopic>
